@echo off
mode con: cols=56 lines=32
cls
color 3f
start call light.bat
:off
cls
echo. > "off.tmp"
echo.
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   ллллллллллллллллллллл          ллллллллллллллллллллл
echo   ллллллллллллллллллллл          ллллллллллллллллллллл
echo   ллллллллллллллллллллл          ллллллллллллллллллллл
echo   ллллллллллллллллллллл          ллллллллллллллллллллл
echo   лллллллллллллллллллл            лллллллллллллллллллл
echo   лллллллллллллллллллл            лллллллллллллллллллл
echo   лллллллллллллллллллл            лллллллллллллллллллл
echo   лллллллллллллллллллл            лллллллллллллллллллл
echo   ллллллллллллллллллл              ллллллллллллллллллл
echo   ллллллллллллллллллл              ллллллллллллллллллл
echo   лллллллллллллллллллллммммммммммллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
pause >nul
:on
cls
echo. > "on.tmp"
echo.
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллппппппппппллллллллллллллллллллл
echo   ллллллллллллллллллл              ллллллллллллллллллл
echo   ллллллллллллллллллл              ллллллллллллллллллл
echo   лллллллллллллллллллл            лллллллллллллллллллл
echo   лллллллллллллллллллл            лллллллллллллллллллл
echo   лллллллллллллллллллл            лллллллллллллллллллл
echo   лллллллллллллллллллл            лллллллллллллллллллл
echo   ллллллллллллллллллллл          ллллллллллллллллллллл
echo   ллллллллллллллллллллл          ллллллллллллллллллллл
echo   ллллллллллллллллллллл          ллллллллллллллллллллл
echo   ллллллллллллллллллллл          ллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
echo   лллллллллллллллллллллллллллллллллллллллллллллллллллл
pause >nul
goto off